Dlubal.RFEM5.IOrthotropicThickness
Interface for working with surface orthotropic thickness

Dlubal.RFEM5.IOrthotropicThickness.GetData
Gets surface stiffness parameters.
Returns: Surface stiffness parameters

Dlubal.RFEM5.IOrthotropicThickness.SetData(System.UInt32@)
Sets surface stiffness parameters.
Stiffness: Surface stiffness parameters

Dlubal.RFEM5.IOrthotropicThickness.GetStiffnessMatrix
Gets surface orthotropic stiffness matrix parameters.
Returns: Surface orthotropic stiffness matrix parameters

Dlubal.RFEM5.IOrthotropicThickness.SetStiffnessMatrix(System.UInt32@)
Sets surface orthotropic stiffness matrix parameters.
Matrix: Surface orthotropic stiffness matrix parameters

Dlubal.RFEM5.IOrthotropicThickness.GetTransformedStiffnessMatrix
Gets surface transformed orthotropic stiffness matrix parameters.
Returns: Surface transformed orthotropic stiffness matrix parameters